In [ ]:
# Load libraries
import missingno as msno 
import re
import pickle
import pandas as pd
import numpy as np

import sys
np.set_printoptions(threshold=sys.maxsize)

/usr/local/lib/python3.6/dist-packages/statsmodels/tools/_testing.py:19: FutureWarning: pandas.util.testing is deprecated. Use the functions in the public API at pandas.testing instead.
  import pandas.util.testing as tm

In [ ]:
# Load Data
  
with open('/content/final_output.pkl', 'rb') as f:
    output_1880 = pickle.load(f)
# Replace empty strings with NaN values
output_1880.replace('', np.nan, inplace=True)

output_1850_bk = pd.read_csv("/content/output_1850_bk.csv", index_col=0)
output_1850_mn = pd.read_csv("/content/output_1850_mn.csv", index_col=0)

Clean widow flags

In [ ]:
len(output_1850_mn.loc[(output_1850_mn['Widow-flag'] == 'False')  &  (output_1850_mn['Full Address'].str.startswith('widow'))])

/usr/local/lib/python3.6/dist-packages/pandas/core/ops/array_ops.py:253: FutureWarning: elementwise comparison failed; returning scalar instead, but in the future will perform elementwise comparison
  res_values = method(rvalues)

0

1880 cd

In [ ]:
# widow flag = true if full address contains widow word and widow flag was false
len(output_1880.loc[(output_1880['Widow-flag'] == 'False')  &  (output_1880['Full Address'].str.startswith('widow'))])

4

In [ ]:
print(output_1880.loc[(output_1880['Widow-flag'] == 'False')  &  (output_1880['Full Address'].str.startswith('widow')), 'Full Address'])
output_1880.loc[(output_1880['Widow-flag'] == 'False')  &  (output_1880['Full Address'].str.startswith('widow')), 'Widow-flag'] = 'True'
output_1880['Full Address'] = output_1880['Full Address'].str.replace('widow ','')

65722                widow h 348 E. 33d
89062                widow h 340 E. 33d
91135               widow h 405 E. 71st
139014    widow (refused) h 443 W. 37th
Name: Full Address, dtype: object

In [ ]:
# widow flag = true if full address contains widow word and widow flag was false
len(output_1880.loc[(output_1880['Widow-flag'] == 'False')  &  (output_1880['Full Address'].str.startswith('widow'))])

0

combine occupations from all the three files

Keep the occupations which are atleast 3 letter words to avoid unnecessary errors

In [ ]:
# non null values
output_1850_bk['Occupation'] = output_1850_bk['Occupation'].str.replace(')','')
output_1850_mn['Occupation'] = output_1850_mn['Occupation'].str.replace(')','')
output_1880['Occupation'] = output_1880['Occupation'].str.replace(')','')

output_1850_bk['Occupation'] = output_1850_bk['Occupation'].str.replace('.','')
output_1850_mn['Occupation'] = output_1850_mn['Occupation'].str.replace('.','')
output_1880['Occupation'] = output_1880['Occupation'].str.replace('.','')

output_1850_bk['Occupation'] = output_1850_bk['Occupation'].str.replace(',','')
output_1850_mn['Occupation'] = output_1850_mn['Occupation'].str.replace(',','')
output_1880['Occupation'] = output_1880['Occupation'].str.replace(',','')

x = output_1850_bk.loc[output_1850_bk['Occupation'].notnull(), ['Occupation']]
x = x.append(output_1850_mn.loc[output_1850_mn['Occupation'].notnull(), ['Occupation']])
x = x.append(output_1880.loc[output_1880['Occupation'].notnull(), ['Occupation']])

x = x[~(x.Occupation.str.len() < 4)]
x['Occupation'] = x['Occupation'].str.lower()

Currently there are 14k occupations

In [ ]:
len(x.Occupation.unique())
#len(x)

14579

find rows where occupation is null

In [ ]:
# rows where occupation is null
y = output_1880.loc[(output_1880['Occupation'].isnull()) & (output_1880['Full Address'].notnull()), ['Full Address']]
y['Full Address'] = y['Full Address'].str.replace('.',' ')
# 39k nulls

print(len(y))

# keep records where address has more than one word
for i in range(len(y)):
  if (len(y['Full Address'][i].split()))<2:
    y['Full Address'][i] = None

y = y.loc[y['Full Address'].notnull(), ['Full Address']]
y

40239

            Full Address
8        h r 10 Dominick
11          h 241 W  53d
30      h 956 Second av
31         h 258 W  44th
68            h 148 Lud-
...                  ...
273053    h 512 E  119th
273065   h 264 Elizabeth
273068      h 139 W  22d
273070       h 32E  20th
273081     h 166 E  34th

[39874 rows x 1 columns]

In [ ]:
# we need o find there are any matches within 7683 full adress

Find if there is an exact match for occupations as substring in the address column

In [ ]:
z = y['Full Address'].str.extract('(%s)' % '|'.join([re.escape(x) for x in x.Occupation.unique()]))
z.columns = ['occupation']
z = z.loc[z['occupation'].notnull(), ['occupation']]
len(z)

4498

In [ ]:
#z.loc[(z.occupation == 'hotel') | (z.occupation == 'boarding house') | (z.occupation == 'foot of' ) | (z.occupation == 'market' ) | (z.occupation == 'office' ) | (z.occupation == 'coffee' ) | (z.occupation == 'select school'), 'occupation'] = None
#z.loc[(z.occupation == 'stone yard') | (z.occupation == 'railroad') | (z.occupation == 'express' ), 'occupation'] = None

z.loc[(z.occupation == 'purser'), 'occupation'] = "purser's clerk"
z.loc[(z.occupation == 'sheet iron worker'), 'occupation'] = "tin and sheet iron worker  "

In [ ]:
z = z.loc[z['occupation'].notnull(), ['occupation']]
len(z)

4498

In [ ]:
len(z.occupation.unique())

410

A total of 4k records found a match for occupations in their addresses

In [ ]:
#output_1850_bk = output_1850_bk.drop(['occupation'], axis=1)
output_1880 = output_1880.join(z)

In [ ]:
output_1880['len_occ']=0
output_1880.loc[(output_1880['occupation'].notnull()),'len_occ'] = output_1880.loc[(output_1880['occupation'].notnull()),'occupation'].str.len()

Assumption is that the address will start with occupation in case the occupation column is null, so match the found occupation substring with the starting words in the address columns

In [ ]:
#z.loc[z['Full Address'].notnull(), 'Full Address'].str[0:z.iloc[z['len_occ']]]

output_1880['Old_Occupation_info'] = output_1880['Occupation']
output_1880['add_sub_match'] = '0'
output_1880['new_occ_found'] = 'False'

for i in range(len(output_1880)):
  output_1880['add_sub_match'][i] = str(output_1880.iloc[i]['Full Address'])[0:output_1880.iloc[i]["len_occ"]]

  if ((output_1880['occupation'][i] == output_1880['add_sub_match'][i])):
    output_1880['new_occ_found'][i] = 'True'

    if (len(output_1880['Full Address'][i].split(',')) > 1):
      output_1880['Occupation'][i] = output_1880['Full Address'][i].split(',')[0]
    else:
      output_1880['Occupation'][i] = output_1880['occupation'][i]


  if ((output_1880['new_occ_found'][i] == 'False') & (str(output_1880['Full Address'][i]).startswith('mer'))):
    output_1880['new_occ_found'][i] = 'True'
    output_1880['Occupation'][i] = 'merchant'

Mark the occupation found column as assume if there are still matches in the previous step but the address column doesnot start with the matched occupation

In [ ]:
for i in range(len(output_1880)):
  if ((output_1880['new_occ_found'][i] == 'False') & (str(output_1880.iloc[i]['occupation']) != 'nan')):
    output_1880['new_occ_found'][i] = 'assume'
    output_1880['Occupation'][i] = output_1880['occupation'][i]

In [ ]:
print(len(output_1880.loc[(output_1880['new_occ_found'] == 'True')]))

output_1880.loc[(output_1880['new_occ_found'] == 'True')].head()

967

                    Full Name First Name  ... add_sub_match new_occ_found
591              Ziegler Wm.H       Wm.H  ...          coal          True
1013         Zabriskie John A       John  ...         clerk          True
1056           Zaerban Andrew     Andrew  ...          silk          True
1266  Young William & Brother        NaN  ...       plumber          True
1351           Young George H     George  ...        lawyer          True

[5 rows x 25 columns]

In [ ]:
print(len(output_1880.loc[(output_1880['new_occ_found'] == 'assume')]))

3539

try more fuzzy name match algorithms for remaining records

In [ ]:
# try more fuzzy  name match algorithms

uni_occ = x.Occupation.unique()

import pandas as pd
!pip install fuzzywuzzy
from fuzzywuzzy import process, fuzz

def find_match(x):

    match = process.extract(x, uni_occ, scorer=fuzz.WRatio, limit=1)
    return pd.Series([match[0][0], match[0][1]])

Requirement already satisfied: fuzzywuzzy in /usr/local/lib/python3.6/dist-packages (0.18.0)

In [ ]:
len(uni_occ)

14458

subset those records which not recognized by substring matching (7196 out of 7683)

In [ ]:
# rows where occupation is null
nm_match_add = output_1880.loc[(output_1880['Old_Occupation_info'].isnull()) & (output_1880['new_occ_found'] != 'True') & (output_1880['Full Address'].notnull()), ['Full Address']]
nm_match_add['Full Address'] = nm_match_add['Full Address'].str.replace('.',' ')
# 39k nulls

print(len(nm_match_add))
print(len(y))


# keep records where address has more than one word
for i in range(len(nm_match_add)):
  if (len(nm_match_add['Full Address'][i].split()))<2:
    nm_match_add['Full Address'][i] = None

nm_match_add = nm_match_add.loc[nm_match_add['Full Address'].notnull(), ['Full Address']]
nm_match_add

39284
39874

            Full Address
8        h r 10 Dominick
11          h 241 W  53d
30      h 956 Second av
31         h 258 W  44th
68            h 148 Lud-
...                  ...
273053    h 512 E  119th
273065   h 264 Elizabeth
273068      h 139 W  22d
273070       h 32E  20th
273081     h 166 E  34th

[38919 rows x 1 columns]

In [ ]:
nm_match_add

            Full Address
8        h r 10 Dominick
11          h 241 W  53d
30      h 956 Second av
31         h 258 W  44th
68            h 148 Lud
...                  ...
273053    h 512 E  119th
273065   h 264 Elizabeth
273068      h 139 W  22d
273070       h 32E  20th
273081     h 166 E  34th

[38919 rows x 1 columns]

In [ ]:
import re
# clean the records remove digits and special characters 
for i in range(len(nm_match_add)):
  nm_match_add['Full Address'][i] = re.sub("[^a-zA-Z0-9]", 
                          " ",     
                          str(nm_match_add['Full Address'][i]))
  
  nm_match_add['Full Address'][i] = str(nm_match_add['Full Address'][i])


for i in range(len(uni_occ)):
  uni_occ[i] = re.sub("[^a-zA-Z0-9]", 
                          " ",     
                          str( uni_occ[i]))
  
  uni_occ[i] = str(uni_occ[i])

In [ ]:
# do name matching only for false and assume in new_occ_found 
nm_match_add['new_occ'] = 'False'
nm_match_add['match_rating'] = 0

count = 0
for i in range(len(nm_match_add)):
  split_str = str(nm_match_add['Full Address'][i]).split(",")
  match = find_match(split_str[0])
  nm_match_add['new_occ'][i] =match[0]                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                      
  nm_match_add['match_rating'][i] = match[1]

  if ((len(split_str) > 1) & (nm_match_add['match_rating'][i] < 90)):
    match = find_match(split_str[1]) 
    if match[1] > nm_match_add['match_rating'][i]:
      nm_match_add['new_occ'][i] =match[0]                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                      
      nm_match_add['match_rating'][i] = match[1]
    
  count = count + 1
  if (count % 500 == 0):
    print(count)

In [ ]:
output_1880.to_csv('1880_occmatch_output.csv')
nm_match_add.to_csv('1880_nm_match_add.csv') # matches found were similar to 'assume' category output so didnot incorporate name match in final file

In [ ]:
output_1880 = pd.read_csv("/content/1880_occmatch_output.csv", index_col=0, low_memory= False)

len(output_1880)

273088

Number of new occupations found in each true, and assume category

In [ ]:
len(output_1880.loc[(output_1880['new_occ_found'] == 'TRUE')])

967

In [ ]:
len(output_1880.loc[(output_1880['new_occ_found'] == 'FALSE')])

271861

In [ ]:
len(output_1880.loc[(output_1880['new_occ_found'] == 'assume')])

260

In [ ]:
output_1880.to_csv('output_1880.csv')

There are a total of 10k matches

Examples of absolute occupation match

In [ ]:
output_1880.loc[(output_1880['new_occ_found'] == 'TRUE'), ['Full Name','Occupation','Full Address']]

                      Full Name  ...                           Full Address
591                Ziegler Wm.H  ...  coal,1’11 B’way,h 24 First pl. B’klyn
1013           Zabriskie John A  ...                     clerk h 505 W. 23d
1056             Zaerban Andrew  ...       silk,457 Broome,h 1410 Sixth av.
1266    Young William & Brother  ...                plumbers,1022 Third av.
1351             Young George H  ...                 lawyer h 260 Rivington
...                         ...  ...                                    ...
270817      Alexander Archibald  ...  prof. E. 49th c Madison av. h Hoboken
271595             Adnet Joseph  ...     dyer 19 W. 3d & 627 Sixth av. h 19
271918             Adams Samuel  ...   hats,158 S. 5th av.h 64 Prospect pl.
271983          Adams William C  ...                  clerk h 423 Third av.
272805           Abraham Philip  ...      paints,469 Sixth av.h Rossmore h.

[967 rows x 3 columns]

Examples of assume occupations

In [ ]:
output_1880.loc[(output_1880['new_occ_found'] == 'assume'), ['Full Name','Occupation','Full Address']]

       Full Name Occupation                                       Full Address
40355        NaN   dressmkr              Smith Frances M dressmkr 14 Sixth av.
76573        NaN   dressmkr  Peterson Christina,wid. Wm.dressmkr. 20 Sixth av.
193430       NaN   dressmkr              Fouqu6 Mary L. dressmkr. 181 Lex. av.
64562        NaN     fcygds  Ridley Edw’d A.fcygds.309 Gran'd,h 1159 Fifth av.
113493       NaN     grocer     McNally Matthew.grocer.319 Hudson,h 116 Varick
...          ...        ...                                                ...
1039         NaN     turner     Zachgow August,turner,371 W. 48th,h 530 W.47th
88427        NaN     lumber            N. Y. Vulcanized Lumber Co. 494 W. 57th
208571       NaN     lumber           Dunbar Box & Lumber Co. 282 Eleventh av.
12976        NaN     writer               Weekly Underwriter (The) 5 Cortlandt
21265        NaN     writer        Underwriter Printing & Pub. Co. 5 Cortlandt

[260 rows x 3 columns]